# Задание 1_Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Surname': ['Ivanov', 'Petrov', 'Sidorov', 'Ivanova', 'Karpov', 'Hill', 'Boni', 'Mitchell', 'Onio', 'Lavrov'],
        'age': [42, 33, 55, np.nan, 65, 23, 25, np.nan, 27, 37],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = [1,2....]

SyntaxError: invalid syntax (<ipython-input-2-13550bc1d159>, line 6)

#### 0. Создать датафрейм.

In [7]:
df = pd.DataFrame({'Surname': ['Ivanov', 'Petrov', 'Sidorov', 'Ivanova', 'Karpov', 'Hill', 'Boni', 'Mitchell', 'Onio', 'Lavrov'],
        'age': [42, 33, 55, np.nan, 65, 23, 25, np.nan, 27, 37],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']})
df

    Surname   age  visits priority
0    Ivanov  42.0       1      yes
1    Petrov  33.0       3      yes
2   Sidorov  55.0       2       no
3   Ivanova   NaN       3      yes
4    Karpov  65.0       2       no
5      Hill  23.0       3       no
6      Boni  25.0       1       no
7  Mitchell   NaN       1      yes
8      Onio  27.0       2       no
9    Lavrov  37.0       1       no

#### 1. Вывести информацию о датафрейме.

In [17]:
frame.columns

Index(['Surname', 'age', 'visits', 'priority'], dtype='object')

In [9]:
frame.shape

(10, 4)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Surname     10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [11]:
df.head(3)

   Surname   age  visits priority
0   Ivanov  42.0       1      yes
1   Petrov  33.0       3      yes
2  Sidorov  55.0       2       no

#### 3. Выберите только столбцы 'Surname' и 'age' из DataFrame `df`.

In [29]:
df[['Surname','age']]

    Surname   age
0    Ivanov  42.0
1    Petrov  33.0
2   Sidorov  55.0
3   Ivanova   NaN
4    Karpov  65.0
5      Hill  23.0
6      Boni  25.0
7  Mitchell   NaN
8      Onio  27.0
9    Lavrov  37.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['Surname', 'age']`.

In [82]:
df.loc[[3,4,8],['Surname','age']]

   Surname   age
3  Ivanova   NaN
4   Karpov  65.0
8     Onio  27.0

#### 5. Выберите строки где количество посещений банка больше 3.

In [84]:
df.loc[(df['visits'] >= 3)]

   Surname   age  visits priority
1   Petrov  33.0       3      yes
3  Ivanova   NaN       3      yes
5     Hill  23.0       3       no

In [85]:
df[df.visits>=3]

   Surname   age  visits priority
1   Petrov  33.0       3      yes
3  Ivanova   NaN       3      yes
5     Hill  23.0       3       no

#### 6. Выберите строки, в которых отсутствует возраст.

In [94]:
df[df.age.isnull()]

    Surname  age  visits priority
3   Ivanova  NaN       3      yes
7  Mitchell  NaN       1      yes

#### 7. Выберите строки, в которых клиент был больше 2х раз в банке * и * возраст составляет более 30 лет.

In [101]:
df[(df.visits>2) & (df.age>30)]

  Surname   age  visits priority
1  Petrov  33.0       3      yes

#### 8. Выберите строки в которых возраст от 55 до 65 (включительно).

In [105]:
df[(df.age>55) & (df.age<=65)]

  Surname   age  visits priority
4  Karpov  65.0       2       no

#### 9. Измените возраст в строке '4' на 44.

In [108]:
df.loc[4,'age'] = 44

In [109]:
df.loc[4,'age']

44.0

#### 10. Рассчитать общее количество всех посещений.

In [110]:
df['visits'].sum()

19

#### 11. Расчитайте средний возраст клиентов

In [111]:
df['age'].mean()

35.75

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [113]:
new_line = {'Surname':'Perov', 'age':99, 'visits':100}
new_line

{'Surname': 'Perov', 'age': 99, 'visits': 100}

In [132]:
df=df.append(new_line, ignore_index=True)

In [133]:
df

     Surname   age  visits priority
0     Ivanov  42.0       1      yes
1     Petrov  33.0       3      yes
2    Sidorov  55.0       2       no
3    Ivanova   NaN       3      yes
4     Karpov  44.0       2       no
5       Hill  23.0       3       no
6       Boni  25.0       1       no
7   Mitchell   NaN       1      yes
8       Onio  27.0       2       no
9     Lavrov  37.0       1       no
10     Perov  99.0     100      NaN

In [136]:
df=df.drop([10], axis=0)

In [137]:
df

    Surname   age  visits priority
0    Ivanov  42.0       1      yes
1    Petrov  33.0       3      yes
2   Sidorov  55.0       2       no
3   Ivanova   NaN       3      yes
4    Karpov  44.0       2       no
5      Hill  23.0       3       no
6      Boni  25.0       1       no
7  Mitchell   NaN       1      yes
8      Onio  27.0       2       no
9    Lavrov  37.0       1       no

#### 13. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [139]:
df.sort_values(by='visits').sort_values(by='age')

    Surname   age  visits priority
5      Hill  23.0       3       no
6      Boni  25.0       1       no
8      Onio  27.0       2       no
1    Petrov  33.0       3      yes
9    Lavrov  37.0       1       no
0    Ivanov  42.0       1      yes
4    Karpov  44.0       2       no
2   Sidorov  55.0       2       no
7  Mitchell   NaN       1      yes
3   Ivanova   NaN       3      yes

#### 14. В столбце приоритет замените значения на `Yes` и `No`

In [141]:
df.loc[df['priority']=='no', 'priority'] = 'No'

In [143]:
df.loc[df['priority']=='yes', 'priority'] = 'Yes'

In [144]:
df

    Surname   age  visits priority
0    Ivanov  42.0       1      Yes
1    Petrov  33.0       3      Yes
2   Sidorov  55.0       2       No
3   Ivanova   NaN       3      Yes
4    Karpov  44.0       2       No
5      Hill  23.0       3       No
6      Boni  25.0       1       No
7  Mitchell   NaN       1      Yes
8      Onio  27.0       2       No
9    Lavrov  37.0       1       No

#### 15. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [146]:
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = list('abcdefghij'))

In [147]:
df

,a,b,c,d,e,f,g,h,i,j
0,0.874767,0.293536,0.207842,0.250433,0.515022,0.820767,0.017164,0.252251,0.844017,0.506517
1,0.857415,0.425699,0.706136,0.274396,0.090524,0.775998,0.843085,0.580010,0.798767,0.169725
2,0.017061,0.375207,0.093868,0.599920,0.550094,0.581243,0.608329,0.007758,0.132741,0.975104
3,0.102135,0.182564,0.575052,0.263070,0.262907,0.777421,0.498780,0.445909,0.899424,0.068445
4,0.954005,0.799641,0.555260,0.118042,0.901132,0.345035,0.597754,0.104214,0.939398,0.863768

In [162]:
df.sum().sort_values().index[0]

'h'

#### 16. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [169]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})

In [170]:
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [173]:
df.loc[df.value.isnull(),'value']= df['value'].mean()

In [174]:
df

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 17. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [202]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

In [203]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [209]:
new_df = df['From_To'].str.split('_',expand=True)
new_df.columns=['From','To']

In [216]:
new_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [223]:
dfs = pd.concat([df, new_df],axis=1)

In [229]:
dfs

,From_To,FlightNumber,RecentDelays,Airline,From,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),1,LoNDon,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),1,MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),1,londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,1,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",1,Brussels,londOn

In [230]:
dfs.drop('From_To', axis=1, inplace=True)

In [236]:
dfs

   FlightNumber  RecentDelays              Airline From      From         To
0       10045.0      [23, 47]               KLM(!)    1    LoNDon      paris
1           NaN            []    <Air France> (12)    1    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    1    londON  StockhOlm
3           NaN          [13]       12. Air France    1  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"    1  Brussels     londOn

In [237]:
dfs['From'].capitalize()

KeyError: 'From'

#### 23. Загрузить свою таблицу данных(из реферата, курсовой, из сайта статистических данных). 

Выполните действия с таблицей:

Загрузите таблицу из файла и сохраните ее в переменную df. Используйте функцию read_

Выведите общую информацию по таблице: число строк и столбцов, типы данных в таблице. 

Есть ли в таблице пропущенные значения?

Если в таблице есть строки с пропущенными значениями, удалите их.

Сохраните изменения в df.

Выведите на экран описательные статистики по всем количественным переменным в таблице. 

Выберите какой-нибудь интересующий вас столбец и проинтерпретируйте описательные статистики по нему (т.е. опишите «обычными» словами, что значат значения типа min, std, 50% и так далее).


Переименуйте какие-нибудь столбцы в таблице (хотя бы один, можно несколько) и сохраните изменения в df.

Добавьте новые столбцы.

ссылки на сайты стат данных

    
https://data.gov.ru/taxonomy/term/9/datasets
    
http://sophist.hse.ru/rstat/

можно взять данные из задач 

https://github.com/hightemp/docNN/blob/b96f37611dd3ebdd5b2269e04582683af74b8340/articles/%D0%9F%D1%80%D0%B8%D0%BC%D0%B5%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%BC%D0%B0%D1%88%D0%B8%D0%BD%D0%BD%D0%BE%D0%B3%D0%BE%20%D0%BE%D0%B1%D1%83%D1%87%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%B8%20Data%20Science%20%D0%B2%20%D0%BF%D1%80%D0%BE%D0%BC%D1%8B%D1%88%D0%BB%D0%B5%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D0%B8.md

In [240]:
df = pd.read_csv(r'C:\\BudgBelgorod.csv', header=0,encoding='cp1251')

In [241]:
df

,Наименование показателя,Код строки,Код дохода по бюджетной классификации,Утвержденные бюджетные назначения,Исполнено,Неисполненные назначения
0,Расходы бюджета - всего\n в том числе:,200,Х,1.102553e+11,1.787526e+10,92380034682.75999
1,Общегосударственные вопросы,200,000 0100 0000000000 000,2.171054e+09,2.937301e+08,1877324411.07
2,Функционирование высшего должностного лица суб...,200,000 0102 0000000000 000,4.454000e+06,7.398028e+05,3714197.21
3,Расходы на выплаты персоналу в целях обеспечен...,200,000 0102 0000000000 100,4.454000e+06,7.398028e+05,3714197.21
4,Расходы на выплаты персоналу государственных (...,200,000 0102 0000000000 120,4.454000e+06,7.398028e+05,3714197.21
...,...,...,...,...,...,...
992,Иные дотации,200,000 1402 0000000000 512,1.180106e+09,1.387570e+08,1041349000
993,Прочие межбюджетные трансферты общего характера,200,000 1403 0000000000 000,4.333980e+08,1.083510e+08,325047000
994,Межбюджетные трансферты,200,000 1403 0000000000 500,4.333980e+08,1.083510e+08,325047000
995,Субвенции,200,000 1403 0000000000 530,4.333980e+08,1.083510e+08,325047000
996,Результат исполнения бюджета (дефицит/профицит),450,Х,-7.095868e+09,5.561811e+08,Х

In [242]:
df.columns

Index(['Наименование показателя', 'Код строки',
       'Код дохода по бюджетной классификации',
       'Утвержденные бюджетные назначения', 'Исполнено',
       'Неисполненные назначения'],
      dtype='object')

In [243]:
df.shape

(997, 6)

In [244]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 997 entries, 0 to 996
Data columns (total 6 columns):
Наименование показателя                  997 non-null object
Код строки                               997 non-null int64
Код дохода по бюджетной классификации    997 non-null object
Утвержденные бюджетные назначения        996 non-null float64
Исполнено                                774 non-null float64
Неисполненные назначения                 993 non-null object
dtypes: float64(2), int64(1), object(3)
memory usage: 46.9+ KB

Переименуйте какие-нибудь столбцы в таблице (хотя бы один, можно несколько) и сохраните изменения в df

In [246]:
df.columns

Index(['Наименование показателя', 'Код строки',
       'Код дохода по бюджетной классификации',
       'Утвержденные бюджетные назначения', 'Исполнено',
       'Неисполненные назначения'],
      dtype='object')

In [247]:
df.columns=['Наименование показателя', 'Код строки',
       'Код дохода по бюджетной классификации',
       'Утв. бюджетные назначения', 'Исп. назначения',
       'Неисп. назначения']

In [248]:
df.columns

Index(['Наименование показателя', 'Код строки',
       'Код дохода по бюджетной классификации', 'Утв. бюджетные назначения',
       'Исп. назначения', 'Неисп. назначения'],
      dtype='object')

Добавьте новые столбцы.

In [250]:
df['Проверено']= bool('true')

In [251]:
df

,Наименование показателя,Код строки,Код дохода по бюджетной классификации,Утв. бюджетные назначения,Исп. назначения,Неисп. назначения,Проверено
0,Расходы бюджета - всего\n в том числе:,200,Х,1.102553e+11,1.787526e+10,92380034682.75999,True
1,Общегосударственные вопросы,200,000 0100 0000000000 000,2.171054e+09,2.937301e+08,1877324411.07,True
2,Функционирование высшего должностного лица суб...,200,000 0102 0000000000 000,4.454000e+06,7.398028e+05,3714197.21,True
3,Расходы на выплаты персоналу в целях обеспечен...,200,000 0102 0000000000 100,4.454000e+06,7.398028e+05,3714197.21,True
4,Расходы на выплаты персоналу государственных (...,200,000 0102 0000000000 120,4.454000e+06,7.398028e+05,3714197.21,True
...,...,...,...,...,...,...,...
992,Иные дотации,200,000 1402 0000000000 512,1.180106e+09,1.387570e+08,1041349000,True
993,Прочие межбюджетные трансферты общего характера,200,000 1403 0000000000 000,4.333980e+08,1.083510e+08,325047000,True
994,Межбюджетные трансферты,200,000 1403 0000000000 500,4.333980e+08,1.083510e+08,325047000,True
995,Субвенции,200,000 1403 0000000000 530,4.333980e+08,1.083510e+08,325047000,True
996,Результат исполнения бюджета (дефицит/профицит),450,Х,-7.095868e+09,5.561811e+08,Х,True